tnews_list = {
    'title': {
        'non-unicode': {
            'one': 'Взлом основного бота Vision и комментарии от его автора',
            'two': 'Открытое тестирование бота Vision подошло к концу',
            'three': 'Падение сервисов Google и его последствия',
            'four': 'Чем отличается бот Vision от фейков (или клонов)?'
        },
        'one': '1⃣ Взлом основного бота Vision и комментарии от его автора',
        'two': '2⃣ Открытое тестирование бота Vision подошло к концу',
    },
    'news': {
        'one': 'Ночью с 30 на 31 декабря произошел взлом основного бота Vision, подробности которого мы стараемся не разглашать, но сейчас стало известно о прекращении разработки основного бота Vision. Но у нас есть запасной вариант - Vision Unstable. Исходные файлы и токены теперь находятся на приватном репозитории GitHub _(я надеюсь)_\n\nP. S. Во время перемирия с Тинеликсом, RFX9870 и This Klark разработка бота уже продолжается, большинство фейков на Тинеликса уже закрыты.',
        'two': 'Бот Vision уже полностью готов к круглосуточной работе. В ходе открытого тестирования были выявлены и пофикшены баги: в `=profile -u` пофикшен баг со пустыми списками ролей (исключая роль `everyone`) и в `=profile -g` пофикшен баг с каналом для правил.\nСейчас бот работает круглосуточно, благодаря `repl.it` и Freshping.\nНе обошлось без добавления функциональности бота. Прямо сейчас можно посмотреть отсчет до Нового года в 5 часовых поясах (в своем, в Москве, в Челябинске, в Барнауле и в Улан-Удэ). Если же не хватает, к примеру, пояса UTC+6:00, попробуйте прибавить часы на 1 или в настройках поменяйте руками.\nПолностью доведен до ума кулдаун до 5 секунд, теперь никаким музыкальным Alt+F4 на фоне и не пахнет, для этого мы улучшили таблицы `users` и `guild` в своей БД SQLite.',
    },
    'images': {
        'one': '',
        'two': '',
    },
    'footer': 'Актуально на 2 января 2020 г.'
}
