tnews_list = {
    'title': {
        'non-unicode': {
            'one': 'Релиз Vision 01R5 (8 января 2021 г.)',
            'two': 'Бот теперь доступен в одном из мониторингов',
            'three': 'Падение сервисов Google и его последствия',
            'four': 'Чем отличается бот Vision от фейков (или клонов)?'
        },
        'one': '1⃣ Скоро новый релиз - VisionOne 01R8 (21 января 2021 г.)',
        'two': '2⃣ Наш саппорт-сервер VisionOne уже открыт!',
    },
    'news': {
        'one': 'Скоро будет размещен новый релиз бота VisionOne - 01R8, сегодня или завтра, пока все будет полностью протестировано.\n\n**Изменения**:\n1. Будет добавлена ручная смена префикса бота.\n2. Будет добавлена глобальная система уровней\n3. Станет возможным задавать свои приветственные и прощальные сообзения для Вашего сервера.',
        'two': 'Перейти можно по нашей ссылке в `=info`.',
    },
    'images': {
        'one': '',
        'two': 'https://cdn.discordapp.com/attachments/787270057952542720/797275961337839716/Screenshot_2021-01-09-08-29-34.png',
    },
    'footer': 'Актуально на 21 января 2020 г.'
}
